Repository: Ramsau/Christophroyer
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: Phone
de: Telefon

source: Project idea*
de: Projektidee*

source: Description*
de: Beschreibung

source: Send copy to me
de: Kopie an mich senden

source: I agree with the <a href="{0}">Terms of service</a>*
de: Ich stimme den <a href="{0}">Nutzungsbestimmungen</a> zu*

source: German
de: Deutsch

source: English
de: Englisch

source: Christoph Royer is a web and software developer from Ramsau, Austria
de: Christoph Royer ist ein Webdesigner und Softwareentwickler aus der Ramsau, Österreich

source: Projects
de: Projekte

source: Commissions
de: Aufträge

source: Privacy
de: Datenschutz

source: Then you will know the truth, and the truth will set you free.
de: Und ihr werdet die Wahrheit erkennen, und die Wahrheit wird euch frei machen.

source: John 8:32
de: Joh 8:32

source: <p> I would love to hear your project ideas or software requests - the more exotic, the better. Whether it's about a piece of software or website I can design for your business or a novel idea we can take co-ownership of - Let's see what we can do together! </p> <p> After you write to me, we can get together personally to work out a concept or write via E-mail - of course free of charge and without commitment. I provide quick, personal feedback when it comes to requests, questions or errors in my work - not the impersonal, slow-moving customer service known from big companies. So get in touch, I'm looking forward to hearing from you! </p>
de: <p> Ich würde liebend gern von Ihren Projektideen oder Softwareaufträgen hören - je exotischer, umso besser. Ob es nun um ein Stück Software oder eine Webseite geht, die Ich für Ihr Unternehmen erstellen darf, oder eine originelle Projektidee, an der wir zusammen Anteil haben können - Sehen wir was wir zusammen (er)schaffen können! </p> <p> Nach Ihrer Anfrage können wir persönlich oder per E-Mail die Einzelheiten des Projekts besprechen - natürlich kostenlos und ohne Bindung. Ich melde mich schnell und persönlich wenn es um Vorschläge, Fragen und etwaige Fehler in meiner Arbeit geht - im Gegensatz zum unpersönlichen, langsamen Kundenservice, wie er bei großen Firmen bekannt ist. Also schreiben Sie mir, Ich freue mich von Ihnen zu hören! </p>

source: Mail
de: E-Mail

source: Send
de: Senden

source: Sending mail, please wait...
de: Mail wird gesendet, bitte warten...

source: I'm a self-taught programmer with a focus on learning new things and making possible whatever I find interesting.<br> Continue reading to learn more about me, or go look at a few of my <a href="%(projects_url)s">Projects</a>.
de: Ich bin ein selbstständiger Softwareentickler mit einem Fokus darauf, neue Fähigkeiten zu erlernen und möglich zu machen, was mir interessant vorkommt.<br> Lesen Sie weiter, um mehr über mich zu erfahren, oder schauen Sie sich ein paar meiner <a href="%(projects_url)s">Projekte</a> an.

source: Don't settle for the known.
de: Nicht mit dem Bekannten zufrieden geben.

source: Nowadays, everything can be - and is - copied from others, which is why it's important to me to keep improving, reiterating and reimagining. How would we stand out after all if everything has to look the same?<br> Because of this, I create each project with its own style and feel, sometimes stubbornly building from the ground up just to make the project truly mine.
de: Heutzutage kann - und wird - alles von anderen kopiert. Gerade deshalb ist es wichtig, sich weiter zu entwickeln, neue Wege zu gehen und Neues zu schaffen. Wie würden wir sonst noch herausstechen, wenn alles gleich aussehen muss?<br> Aus dieser Überzeugung heraus entwickle ich jedes meiner Projekte in seinem eigenen Stil, wobei ich oft stur vom Grund auf alles neu baue, damit das Endprodukt wirklich mein Werk ist.

source: About me
de: Über mich

source: Profile image
de: Profilfoto

source: I was born in 2001 and I come from Ramsau, Austria. Since autumn of 2020, I have been studying Computer Science at <a href="https://www.tugraz.at" target="_blank">TU Graz</a>.
de: Ich wurde 2001 geboren und komme aus der Ramsau, Österreich. Seit dem Herbst 2020 studiere ich an der <a href="https://www.tugraz.at" target="_blank">TU Graz</a> Informatik.

source: While studying at Highschool in Radstadt, I started taking an interest in software development. After my first year coding in <a href="https://docs.microsoft.com/en-us/dotnet/csharp/tour-of-csharp/" target="_blank">C#</a>, and getting to know the principles of programming, I moved over to <a href="https://python.org" target="_blank">Python</a>, which is my main strength to this day. But through my various pet projects and university courses I do have a wider base of knowledge: from <a href="https://arduino.cc" target="_blank">Arduino</a>'s C to the "big three" of web development - JavaScript, Html and CSS - but also App development with <a href="https://flutter.dev" target="_blank">Flutter</a>, among bits and pieces from other frameworks.<br> In University, I have been learning a lot about the theoretical side of computer science, as well as getting hands-on experience in C, C++, SQL and Java.
de: Während ich in Radstadt im BORG war, entwickelte ich ein Interesse an Softwareentwicklung. Nach dem ersten Jahr mit <a href="https://docs.microsoft.com/en-us/dotnet/csharp/tour-of-csharp/" target="_blank">C#</a> - wo ich die Grundsätze des Programmierens erfahren konnte - fing ich mit <a href="https://python.org" target="_blank">Python</a> an, was bis heute meine Stärke ist. Doch durch zahlreiche andere Hobbyprojekte und Uni-Kurse habe ich noch einige andere Umgebungen kennen gelernt: Von <a href="https://arduino.cc" target="_blank">Arduino</a>'s C über den Grundstock der Webentwicklung - JavaScript, Html und CSS - bis hin zu App-Entwicklung mit <a href="https://flutter.dev" target="_blank">Flutter</a>, dazu noch kleine Einblicke in andere Frameworks.<br> In der Universität konnte ich viel über den theoretischen Hintergrund der Informatik lernen, darüber hinaus konnte ich meine praktische Erfahrung in C, C++, SQL und Java ausbauen.

source: Project request
de: Projektanfragen

source: proposed the following project:
de: stellt folgendes Projekt vor:

source: This message was sent from
de: Diese Nachricht wurde gesendet von

source: If you didn't use this website, tell me via E-Mail
de: Falls Sie diese Website nicht benutzt haben, teilen sie es mir per Mail mit

source: and i will discard your information
de: und ich werde ihre Kontaktinformationen verwerfen

source: Commission requests
de: Auftragsformular

source: When using the request form, you agree that your data will be handled accordingly. Nothing will be stored in a database, but an e-mail containing your information will be sent to mail@christophroyer.com (and to the given mail address if you so wish).
de: Mit der Benutzung des Auftragsformulars stimmen Sie zu, dass ihre Datendementsprechend gehandhabt werden. In der Datenbank wird nichts gespeichert, es wird aber eine E-Mail mit den angegebenen Kontaktinformationenand mail@christophroyer (und gegebenenfalls an die angegebene Adresse) gesendet.

source: Website use
de: Nutzung der Website

source: This site uses Google Analytics to analyse the Website use. The data generated by this is used, to optimise the website and advertising activities.<br> Google Analytics is a web analysis service provided by Google Inc. (1600 Amphitheatre Parkway, Mountain View, CA 94043, United States). Google processes the data concerning website use according to my commission and is committed by contract to take measures to make sure the data are stored and handled responsibly. <br> These data points, among others, may be tracked:
de: Diese Seite verwendet Google Analytics, um die Website-Nutzung zu analysieren. Die daraus gewonnenen Daten werden genutzt, um unsere Website sowie Werbemaßnahmen zu optimieren.<br> Google Analytics ist ein Webanalysedienst, der von Google Inc. (1600 Amphitheatre Parkway, Mountain View, CA 94043, United States) betrieben und bereitgestellt wird. Google verarbeitet die Daten zur Website-Nutzung in meinem Auftrag und verpflichtet sich vertraglich zu Maßnahmen, um die Vertraulichkeit der verarbeiteten Daten zu gewährleisten.<br> Während Ihres Website-Besuchs werden u.a. folgende Daten aufgezeichnet:

source: Visited pages
de: Aufgerufene Seiten

source: Your behaviour (e.g clicks, scrolling behaviour, time spent)
de: Ihr Verhalten auf den Seiten (beispielsweise Klicks, Scroll-Verhalten und Verweildauer)

source: Your approximate location (City and State)
de: Ihr ungefährer Standort (Land und Stadt)

source: Your IP-Address (in shortened form, no possibility of direct relation)
de: Ihre IP-Adresse (in gekürzter Form, sodass keine eindeutige Zuordnung möglich ist)

source: Technical informations (browser, device, resolution)
de: Technische Informationen wie Browser, Internetanbieter, Endgerät und Bildschirmauflösung

source: From where you came onto this page
de: Herkunftsquelle Ihres Besuchs

source: This data is transferred to a Google Server in the USA. Google hereby complies with the privacy laws of the "EU-US Privacy Shield" treaty. <br> Google analytics stores Cookies on your Webbrowser for a duration of two years after your last visit. These Cookies contain a randomly generated User-ID, with which you can be recognised in future website visits. <br> The tracked data are stored together with this random User-ID, which makes the analysis of this pseudonymised data posssible. This user-related data is automatically deleted after 14 months. Other data stays stored in aggregated form for an unlimited duration. <br> Should you not agree to the storage as explained above, you can install <a href="https://tools.google.com/dlpage/gaoptout?hl=de" target="_blank">this Browser Add-On to deactivate Google Analytics</a>.
de: Diese Daten werden an einen Server von Google in den USA übertragen. Google beachtet dabei die Datenschutzbestimmungen des „EU-US Privacy Shield“-Abkommens. <br>Google Analytics speichert Cookies in Ihrem Webbrowser für die Dauer von zwei Jahren seit Ihrem letzten Besuch. Diese Cookies enthaltene eine zufallsgenerierte User-ID, mit der Sie bei zukünftigen Website-Besuchen wiedererkannt werden können. <br>Die aufgezeichneten Daten werden zusammen mit der zufallsgenerierten User-ID gespeichert, was die Auswertung pseudonymer Nutzerprofile ermöglicht. Diese nutzerbezogenen Daten werden automatisch nach 14 Monaten gelöscht. Sonstige Daten bleiben in aggregierter Form unbefristet gespeichert. <br>Sollten Sie mit der Erfassung nicht einverstanden sein, können Sie diese mit der einmaligen Installation des <a href="https://tools.google.com/dlpage/gaoptout?hl=de" target="_blank">Browser-Add-ons zur Deaktivierung von Google Analytics</a> unterbinden.

source: Image
de: Bild

source: Read more...
de: Mehr...

source: This message was sent from christophroyer.com - If you didn't use this website, tell me via E-Mail (mail@christophroyer.com) and I will discard your information
de: Diese Nachricht wurde von christophroyer.com versendet - Wenn Sie diese Website nicht benutzt haben,teilen Sie mir dies per E-Mail (mail@christophroyer.com) mit, und ich werde Ihre Kontaktinformation verwerfen.

source: Error while sending mail, please try again later
de: Fehler beim senden der Mail, bitte versuchen sie es später nochmal

source: Your request was sent - I'll get in touch soon!
de: Ihre Anfrage wurde gesendet - Ich melde mich bald!

source: Invalid data - please check your inputs for errors
de: Ungültige Angaben - Bitte überprüfen Sie Ihre Eingaben auf Fehler
