[{"model": "auth.permission", "pk": 1, "fields": {"name": "Can add log entry", "content_type": 1, "codename": "add_logentry"}}, {"model": "auth.permission", "pk": 2, "fields": {"name": "Can change log entry", "content_type": 1, "codename": "change_logentry"}}, {"model": "auth.permission", "pk": 3, "fields": {"name": "Can delete log entry", "content_type": 1, "codename": "delete_logentry"}}, {"model": "auth.permission", "pk": 4, "fields": {"name": "Can view log entry", "content_type": 1, "codename": "view_logentry"}}, {"model": "auth.permission", "pk": 5, "fields": {"name": "Can add permission", "content_type": 2, "codename": "add_permission"}}, {"model": "auth.permission", "pk": 6, "fields": {"name": "Can change permission", "content_type": 2, "codename": "change_permission"}}, {"model": "auth.permission", "pk": 7, "fields": {"name": "Can delete permission", "content_type": 2, "codename": "delete_permission"}}, {"model": "auth.permission", "pk": 8, "fields": {"name": "Can view permission", "content_type": 2, "codename": "view_permission"}}, {"model": "auth.permission", "pk": 9, "fields": {"name": "Can add group", "content_type": 3, "codename": "add_group"}}, {"model": "auth.permission", "pk": 10, "fields": {"name": "Can change group", "content_type": 3, "codename": "change_group"}}, {"model": "auth.permission", "pk": 11, "fields": {"name": "Can delete group", "content_type": 3, "codename": "delete_group"}}, {"model": "auth.permission", "pk": 12, "fields": {"name": "Can view group", "content_type": 3, "codename": "view_group"}}, {"model": "auth.permission", "pk": 13, "fields": {"name": "Can add user", "content_type": 4, "codename": "add_user"}}, {"model": "auth.permission", "pk": 14, "fields": {"name": "Can change user", "content_type": 4, "codename": "change_user"}}, {"model": "auth.permission", "pk": 15, "fields": {"name": "Can delete user", "content_type": 4, "codename": "delete_user"}}, {"model": "auth.permission", "pk": 16, "fields": {"name": "Can view user", "content_type": 4, "codename": "view_user"}}, {"model": "auth.permission", "pk": 17, "fields": {"name": "Can add content type", "content_type": 5, "codename": "add_contenttype"}}, {"model": "auth.permission", "pk": 18, "fields": {"name": "Can change content type", "content_type": 5, "codename": "change_contenttype"}}, {"model": "auth.permission", "pk": 19, "fields": {"name": "Can delete content type", "content_type": 5, "codename": "delete_contenttype"}}, {"model": "auth.permission", "pk": 20, "fields": {"name": "Can view content type", "content_type": 5, "codename": "view_contenttype"}}, {"model": "auth.permission", "pk": 21, "fields": {"name": "Can add session", "content_type": 6, "codename": "add_session"}}, {"model": "auth.permission", "pk": 22, "fields": {"name": "Can change session", "content_type": 6, "codename": "change_session"}}, {"model": "auth.permission", "pk": 23, "fields": {"name": "Can delete session", "content_type": 6, "codename": "delete_session"}}, {"model": "auth.permission", "pk": 24, "fields": {"name": "Can view session", "content_type": 6, "codename": "view_session"}}, {"model": "auth.permission", "pk": 25, "fields": {"name": "Can add project", "content_type": 7, "codename": "add_project"}}, {"model": "auth.permission", "pk": 26, "fields": {"name": "Can change project", "content_type": 7, "codename": "change_project"}}, {"model": "auth.permission", "pk": 27, "fields": {"name": "Can delete project", "content_type": 7, "codename": "delete_project"}}, {"model": "auth.permission", "pk": 28, "fields": {"name": "Can view project", "content_type": 7, "codename": "view_project"}}, {"model": "auth.permission", "pk": 29, "fields": {"name": "Can add boot signal", "content_type": 8, "codename": "add_bootsignal"}}, {"model": "auth.permission", "pk": 30, "fields": {"name": "Can change boot signal", "content_type": 8, "codename": "change_bootsignal"}}, {"model": "auth.permission", "pk": 31, "fields": {"name": "Can delete boot signal", "content_type": 8, "codename": "delete_bootsignal"}}, {"model": "auth.permission", "pk": 32, "fields": {"name": "Can view boot signal", "content_type": 8, "codename": "view_bootsignal"}}, {"model": "auth.permission", "pk": 33, "fields": {"name": "Can add boot token", "content_type": 9, "codename": "add_boottoken"}}, {"model": "auth.permission", "pk": 34, "fields": {"name": "Can change boot token", "content_type": 9, "codename": "change_boottoken"}}, {"model": "auth.permission", "pk": 35, "fields": {"name": "Can delete boot token", "content_type": 9, "codename": "delete_boottoken"}}, {"model": "auth.permission", "pk": 36, "fields": {"name": "Can view boot token", "content_type": 9, "codename": "view_boottoken"}}, {"model": "contenttypes.contenttype", "pk": 1, "fields": {"app_label": "admin", "model": "logentry"}}, {"model": "contenttypes.contenttype", "pk": 2, "fields": {"app_label": "auth", "model": "permission"}}, {"model": "contenttypes.contenttype", "pk": 3, "fields": {"app_label": "auth", "model": "group"}}, {"model": "contenttypes.contenttype", "pk": 4, "fields": {"app_label": "auth", "model": "user"}}, {"model": "contenttypes.contenttype", "pk": 5, "fields": {"app_label": "contenttypes", "model": "contenttype"}}, {"model": "contenttypes.contenttype", "pk": 6, "fields": {"app_label": "sessions", "model": "session"}}, {"model": "contenttypes.contenttype", "pk": 7, "fields": {"app_label": "christophroyer", "model": "project"}}, {"model": "contenttypes.contenttype", "pk": 8, "fields": {"app_label": "toys", "model": "bootsignal"}}, {"model": "contenttypes.contenttype", "pk": 9, "fields": {"app_label": "toys", "model": "boottoken"}}, {"model": "christophroyer.project", "pk": 1, "fields": {"name_en": "Autonomous Nerf with face recognition", "name_de": "Autonome Nerf mit Gesichtserkennung", "text_en": "Do you like kid's toys, but don't want to put up with the hassle of operating them yourself? Do you feel like autonomous weapons systems are way too far in the future? Then this project is just the thing for you: This foam dart shooter aims at people's heads all by itself and opens fire as soon as the opportunity arises!\n\\A camera that's mounted to the front of the gun sends a video feed to a computer running an OpenCV face detection algorithm. If it finds a face, it sends that information to an Arduino, where it should point the Nerf, which it does with two servo motors - one for up-down and another for left-right movement. As soon as the gun is aimed properly, a relais pulls the trigger and fires away! <a href=\"https://youtu.be/6U0YTjfdiUk\" target=\"_blank\">See it in action</a>", "text_de": "Magst du Kinderspielzeug, willst aber nicht die Arbeit aufzubringen, es selbst zu benutzen? Findest du, dass autonome Waffensysteme noch viel zu weit in der Zukunft liegen? Dann ist dieses Projekt genau für dich: Diese Schaumstoffkanone zielt von selbst auf Gesichter und eröffnet das Feuer, wenn sie die Chance bekommt.\n\\Mit einer Kamera vorne an der Kanone werden Bilder an einen Computer gesendet, der mit einem OpenCV-Algorithmus nach Gesichtern sucht. Wenn er eines gefunden hat, sendet er an einen Arduino die Information, wohin die Nerf zeigen soll. Die zwei Servo-Motoren - jeweils für Links-Rechts bzw. Oben-Unten - steuern auf das Gesicht zu - natürlich unter stetigem Feedback der Kamera. Wenn nun genau genug gezielt wurde, aktiviert ein Relais den Abzug und die Nerf feuert drauf los! <a href=\"https://youtu.be/6U0YTjfdiUk\" target=\"_blank\">Vorzeigevideo</a>", "time_created": "2020-02-07T11:07:21.752Z"}}, {"model": "christophroyer.project", "pk": 2, "fields": {"name_en": "J.a.m.e.S. - the System of Laziness", "name_de": "J.a.m.e.S. - das System der Faulheit", "text_en": "What does a programmer do with a task that takes more than 30 minutes to complete? They spend the next hour automating the solution! \nSo here's what i did when i was faced with the burden of having to walk all the way to my light switch to operate it: I bolted a servo to the wall, hooked a microcomputer up to it and developed an Android application.\nAll so I can turn my light on and off from my phone.\n\\The app communicates with a Tornado-Server running on a Raspberry Pi, which in turn moves the Servo in the proper direction. The app provides a so-called 'quick setting', which can be placed in the top dropdown bar for easier access.", "text_de": "Was macht ein Programmierer, wenn eine Aufgabe länger als 30 Minuten braucht? Er verbringt die nächste Stunde damit, die Lösung zu automatisieren! \nDiesem Grundsatz habe auch ich mich angeschlossen, als ich vor das bekannte Dilemma gestellt wurde, zu Fuß bis zum Lichtschalter gehen zu müssen, um diesen zu betätigen.\nAlso wurde kurzerhand ein Servo an die Wand geschraubt, ein Mikrocomputer drangehängt und eine Android-App entwickelt - nur damit ich vom Handy aus mein Licht ein- und ausschalten kann.\n\\Die App spricht mit dem Tornado-Server, der auf dem Raspberry Pi läuft und den Servo in die jeweilige Richtung bewegt. Für einen schnelleren Zugriff stellt die App ein sogenanntes 'Quicksetting' bereit,\ndas am Smartphone in der oberen Dropdown-Leiste platziert werden kann.", "time_created": "2020-02-06T11:07:21.752Z"}}, {"model": "christophroyer.project", "pk": 3, "fields": {"name_en": "The useless box", "name_de": "Die sinnlose Schachtel", "text_en": "The name's the game: The most useless of all inventions has only one lever to turn it on. As soon as it's turned on, the device turns itself off again. With its rather good-looking appearance, it makes for an interesting, yet totally useless decorative piece.\n\\Inside the box you can find an Arduino, a 5V battery, a relais and a servo. Flipping the lever to 'On' sends a current to the relais, turning on the Arduino.  \nThe Arduino keeps the Relais open with another lead for as long as the servo arm needs to turn the lever off and return. As soon as the arm is back in its box, the Arduino closes the relais, cutting off its own power supply.\nBecause of this, this box uses no electricity at all when it's not powered on! <a href=\"https://youtu.be/3Y3JGh2k_x0\" target=\"_blank\">See it in action</a>", "text_de": "Sie hält was sie verspricht: Die sinnloseste aller Erfindungen hat nur einen einzigen Hebel, um sie einzuschalten. Wenn man diesen betätigt, schaltet sich das Gerät sofort wieder selbst aus. Aus schönem Holz verarbeitet macht sie ein schickes - wenn auch nutzloses - Dekorstück.\n\\In der Box versteckt sich ein Arduino, eine 5V Batterie, ein Relais und ein Servo. Sobald der Hebel betätigt wird, wird das Relais geöffnet und der Arduino startet. Mit einem weiteren Zugang hält sich der Arduino das Relais offen, während der Servo-Arm ausfährt und den Hebel wieder auf 'Aus' stellt. \nSobald der Hebel wieder zurück im Kasten ist, schließt der Arduino das Relais und schneidet sich somit selbst die Stromzufuhr ab. Solang die Schachtel nicht betätigt wird, wird absolut kein Strom verbraucht! <a href=\"https://youtu.be/3Y3JGh2k_x0\" target=\"_blank\">Vorzeigevideo</a>", "time_created": "2020-02-05T11:07:21.752Z"}}, {"model": "christophroyer.project", "pk": 4, "fields": {"name_en": "Lightclock", "name_de": "Uhrnice", "text_en": "Clocks are hard to read - every child knows that. How are you supposed to find out what time it is from a few letters - or worse: clock \"hands\"? \nBut this lightclock comes to the rescue: With its elegant design and in beautiful styrian dialect it shows the time in easily readable text form. \nBy the way: you won't have to set the time yourself thanks to its radio clock receiver.\\\nUnder the hood you'll find an Arduino Nano which reads and parses the time signal of a <a href=\"https://en.wikipedia.org/wiki/DCF77\" target=\"_blank\">DFC77</a> antenna. Once it knows the exact time, the correlating LEDs light up to show the time \"sentence\". To conserve space on the Arduino, every pin can turn on two different clusters of LEDs, depending on whether it is set to 'High' or 'Low'. Three diffusion layers out of an old LCD screen soften the light and spread it out from single points.", "text_de": "Uhren sind schwer zu lesen, das weiß jedes Volksschulkind. Wie soll man auch zwischen den ganzen Zahlen - oder noch schlimmer: Zeigern - herausfinden, wie spät es ist? \nDem soll das Projekt Uhrnice abhilfe schaffen: Mit einem eleganten Design und in schönstem steirer Dialekt zeigt sie die Uhrzeit in einfach lesbarer Textform an. \nEinstellen muss man sie dank Funkuhr-Empfänger natürlich auch nicht.\\\nUnter der Haube findet man einen Arduino Nano, der über einen <a href=\"https://de.wikipedia.org/wiki/DCF77\" target=\"_blank\">DFC77</a>-Empfänger ein Zeitsignal empfängt und dekodiert. Sobald die Uhrzeit bekannt ist, werden die richtigen LEDs angesteuert, um die jeweiligen Worte anzuzeigen. Um Anschlüsse am Arduino zu sparen, kann eine Verbindung durch entweder ein 'High'- oder ein 'Low'-Signal zwei verschiedene LED-Pakete ansteuern. Drei Diffusionsfolien aus einem alten LCD-Bildschirm sorgen dafür, dass sich das Licht etwas ausbreitet und nicht nur kleine weiße Punkte zu sehen sind. \n", "time_created": "2020-05-12T00:00:00Z"}}, {"model": "christophroyer.project", "pk": 5, "fields": {"name_en": "zspod", "name_de": "zspod", "text_en": "This one's for the home crowd, because barely anyone outside of Austria will be able to read this clock anyways. It shows the time in the most elegant styrian dialect, rounding to the nearest five minutes (because who needs to know the exact time anyways?). The E-Paper display makes it look like every time was printed on a sheet of paper and the wooden frame makes the whole thing into a nice decorative piece. Now for sale on <a href=\"mailto:mail@christophroyer.com\">request</a>.\n\\Inside, there's an <a href=\"https://store.arduino.cc/products/arduino-nano\" target=\"_blank\">Arduino Nano</a>, an RTC clock module and an E-Paper display. I really learned a ton on this project, starting with low-power operation and PCB design for the hardware, font rendering and image compression (the Arduino's flash storage is filled up to 98% just by the character data), and finally about supply chains and \"mass\" production.", "text_de": "Dieses Projekt ist meinem viel geliebten Österreich gewidmet, vor allem weil kaum einer außerhalb den eleganten Ennstaler Dialekt lesen könnte. Die Uhrzeit wird auf die nächsten fünf Minuten gerundet angezeigt (ganz ehrlich, genauer will man es eh nie wissen). Das E-Paper Display lässt es aussehen, als ob jede Uhrzeit auf ein Blatt Papier gedruckt wurde, und der Holzzrahmen macht daraus einen wirklichen Blickfang. Jetzt <a href=\"mailto:mail@christophroyer.com\">auf Anfrage</a> zum Verkauf.\n\\Das Herzstück ist ein <a href=\"https://store.arduino.cc/products/arduino-nano\" target=\"_blank\">Arduino Nano</a>, verbunden mit einem RTC-Modul und einem E-Paper Display. Ich habe für dieses Projekt eine Menge gelernt, angefangen bei Low-Power Operation und Platinendesign für die Hardware, dann Font rendering und Bildkompression (der Arduino ist zu 98% voll mit den Bilddaten für die Buchstaben) und zum Schluss noch über Lieferketten und \"Massen\"produktion.", "time_created": "2022-04-11T20:35:40.723Z"}}, {"model": "christophroyer.project", "pk": 6, "fields": {"name_en": "Tankia 2024 - Valerie", "name_de": "Tankia 2024 - Valerie", "text_en": "The 2024 car of the <a href=\"https://www.tugracing.at\" target=\"_blank\">TU Graz Racing Team</a> - nickname Valerie - is one of a kind in <a href=\"https://fsaustria.at/\" target=\"_blank\">Formula Student</a>.\nWith a new aerodynamic concept and a powered ground effect system for added downforce, she is built for speed.\nThe results speak for themselves: We achieved podiums in every single discipline, an overall win, and a world record in the skidpad discipline.\n\\The whole car was developed and manufactured in-house - that includes all mechanical parts, but also PCBs for sensor evaluation, power distribution and data transmission.\nValerie is an electric car, powered by a self-developed battery that drives the four hub motors. \nThe powered ground system consists of three EDF impellers that blow air at 400 km/h under the car.\nThis creates about 200 kg of downforce - even while the car is standing still.\nValerie is the last of its kind: similarly to Formula 1, the governing body of Formula Student has outlawed powered ground systems after 2024 to limit the track performance of the cars.\n", "text_de": "Das Auto der 2024 Saison des <a href=\"https://www.tugracing.at\" target=\"_blank\">TU Graz Racing Team</a> - Spitzname Valerie - ist einzigartig in der <a href=\"https://fsaustria.at/\" target=\"_blank\">Formula Student</a>.\nMit einem neuen aerodynamischen Konzept und einem powered-ground-System für zusätzlichen Abtrieb ist sie ganz auf Geschwindikeit ausgelegt.\nDie Ergebnisse sprechen für sich: Wir konnten in jeder einzelnen Disziplin das Podium erreichen, dazu noch einen Gesamtsieg und einen Weltrekord in der Skidpad Disziplin einfahren.\n\\Das ganze Auto wurde von uns selbst entwickelt und gefertigt - das beinhaltet alle mechanischen Teile, aber auch Platinen für Sensorauswertung, Stromverteilung und Datenübertragung.\nValerie ist ein Elektroauto, angetrieben von einer selbst entwickelten Batterie und vier Nabenmotoren.\nDas powered-ground-System besteht aus drei EDF Impellern die Luft mit 400 km/h unter das Auto blasen. \nDas bringt eine zusätzliche Abtriebskraft von umgerechnet 200 kg - selbst im Stillstand.\nValerie ist die letzte ihrer Art: Ähnlich zur Formel 1 haben die Organisatoren der Formula Student powered-ground-Systeme nach 2024 verboten, um die Leistung der Autos zu reduzieren.\n", "time_created": "2024-11-15T09:46:01.657Z"}}, {"model": "christophroyer.project", "pk": 7, "fields": {"name_en": "Live Telemetry", "name_de": "Live-Telemetrie", "text_en": "Whether to evaluate driver performance, validate settings during testing, or to give insights into the vehicle state during a race - getting live data from a racecar is a crucial feature.\nThe same goes for the <a href=\"https://www.tugracing.at\" target=\"_blank\">TU Graz Racing Team</a>.\nOur self-developed live telemetry solution gets all data from the vehicle's communication network to transmit them over the internet.\nUsing a custom web application, engineers and race supporters can monitor data like tire temperatures and accumulator voltage in real time.\n\\ We developed a PCB to listen to data on 6 separate CAN channels.\nRelevant data points are then sent using an LTE module and a custom-developed protocol based on TCP.\nThe backend server stores data into an <a href=\"https://www.influxdata.com/\" target=\"_blank\">InfluxDB</a>, while preparing a live stream to the <a href=\"https://angular.dev/\" target=\"_blank\">Angular</a>-based user interface.", "text_de": "Sei es um Fahrer zu vergleichen, Einstellungen zu validieren, oder um den Fahrzeugstatus während des Rennens im Blick zu behalten - Live-Daten von einem Rennauto zu bekommen ist ein essenzieller Vorteil. Das gleiche gilt for das <a href=\"https://www.tugracing.at/\" target=\"_blank\">TU Graz Racing Team</a>. Unsere selbst entwickelte Live-Telemetrie Lösung sammelt alle Daten vom Bordnetz des Fahrzeugs und überträgt sie über das Internet. Ingenieure und Renncrew können mit einer selbst gebauten Website Daten wie Reifentemperaturen und Akkuspannung in Echtzeit überwachen.\n\\ Wir haben eine Platine entwickelt, die Daten von 6 verschiedenen CAN Kanälen aufnehmen kann. Relevante Datenpunkte werden dann mithilfe eines LTE-Moduls und einem eigens entwickelten Protokoll auf TCP-Basis übertragen. Der Server speichert die Daten in eine <a href=\"https://www.influxdata.com/\" target=\"_blank\">InfluxDB</a> und bereitet einen Livestream der Daten für das <a href=\"https://angular.dev/\" target=\"_blank\">Angular</a>-basierte User Interface vor.", "time_created": "2024-11-15T15:14:47.704Z"}}]