[{"model": "christophroyer.project", "pk": 1, "fields": {"name_en": "Autonomous Nerf with face recognition", "name_de": "Autonome Nerf mit Gesichtserkennung", "text_en": "Do you like kid's toys, but don't want to put up with the hassle of operating them yourself? Do you feel like autonomous weapons systems are way too far in the future? Then this project is just the thing for you: This foam dart shooter aims at people's heads all by itself and opens fire as soon as the opportunity arises!\n\\A camera that's mounted to the front of the gun sends a video feed to a computer running an OpenCV face detection algorithm. If it finds a face, it sends that information to an Arduino, where it should point the Nerf, which it does with two servo motors - one for up-down and another for left-right movement. As soon as the gun is aimed properly, a relais pulls the trigger and fires away! ", "text_de": "Magst du Kinderspielzeug, willst aber nicht die Arbeit aufzubringen, es selbst zu benutzen? Findest du, dass autonome Waffensysteme noch viel zu weit in der Zukunft liegen? Dann ist dieses Projekt genau für dich: Diese Schaumstoffkanone zielt von selbst auf Gesichter und eröffnet das Feuer, wenn sie die Chance bekommt.\n\\Mit einer Kamera vorne an der Kanone werden Bilder an einen Computer gesendet, der mit einem OpenCV-Algorithmus nach Gesichtern sucht. Wenn er eines gefunden hat, sendet er an einen Arduino die Information, wohin die Nerf zeigen soll. Die zwei Servo-Motoren - jeweils für Links-Rechts bzw. Oben-Unten - steuern auf das Gesicht zu - natürlich unter stetigem Feedback der Kamera. Wenn nun genau genug gezielt wurde, aktiviert ein Relais den Abzug und die Nerf feuert drauf los!", "time_created": "2020-02-07T11:07:21.752Z"}}, {"model": "christophroyer.project", "pk": 2, "fields": {"name_en": "J.a.m.e.S. - the System of Laziness", "name_de": "J.a.m.e.S. - das System der Faulheit", "text_en": "What does a programmer do with a task that takes more than 30 minutes to complete? They spend the next hour automating the solution! \nSo here's what i did when i was faced with the burden of having to walk all the way to my light switch to operate it: I bolted a servo to the wall, hooked a microcomputer up to it and developed an Android application.\nAll so I can turn my light on and off from my phone.\n\\The app communicates with a Tornado-Server running on a Raspberry Pi, which in turn moves the Servo in the proper direction. The app provides a so-called 'quick setting', which can be placed in the top dropdown bar for easier access.", "text_de": "Was macht ein Programmierer, wenn eine Aufgabe länger als 30 Minuten braucht? Er verbringt die nächste Stunde damit, die Lösung zu automatisieren! \nDiesem Grundsatz habe auch ich mich angeschlossen, als ich vor das bekannte Dilemma gestellt wurde, zu Fuß bis zum Lichtschalter gehen zu müssen, um diesen zu betätigen.\nAlso wurde kurzerhand ein Servo an die Wand geschraubt, ein Mikrocomputer drangehängt und eine Android-App entwickelt - nur damit ich vom Handy aus mein Licht ein- und ausschalten kann.\n\\Die App spricht mit dem Tornado-Server, der auf dem Raspberry Pi läuft und den Servo in die jeweilige Richtung bewegt. Für einen schnelleren Zugriff stellt die App ein sogenanntes 'Quicksetting' bereit,\ndas am Smartphone in der oberen Dropdown-Leiste platziert werden kann.", "time_created": "2020-02-06T11:07:21.752Z"}}, {"model": "christophroyer.project", "pk": 3, "fields": {"name_en": "The useless box", "name_de": "Die sinnlose Schachtel", "text_en": "The name's the game: The most useless of all inventions has only one lever to turn it on. As soon as it's turned on, the device turns itself off again. With its rather good-looking appearance, it makes for an interesting, yet totally useless decorative piece.\n\\Inside the box you can find an Arduino, a 5V battery, a relais and a servo. Flipping the lever to 'On' sends a current to the relais, turning on the Arduino.  \nThe Arduino keeps the Relais open with another lead for as long as the servo arm needs to turn the lever off and return. As soon as the arm is back in its box, the Arduino closes the relais, cutting off its own power supply.\nBecause of this, this box uses no electricity at all when it's not powered on!", "text_de": "Sie hält was sie verspricht: Die sinnloseste aller Erfindungen hat nur einen einzigen Hebel, um sie einzuschalten. Wenn man diesen betätigt, schaltet sich das Gerät sofort wieder selbst aus. Aus schönem Holz verarbeitet macht sie ein schickes - wenn auch nutzloses - Dekorstück.\n\\In der Box versteckt sich ein Arduino, eine 5V Batterie, ein Relais und ein Servo. Sobald der Hebel betätigt wird, wird das Relais geöffnet und der Arduino startet. Mit einem weiteren Zugang hält sich der Arduino das Relais offen, während der Servo-Arm ausfährt und den Hebel wieder auf 'Aus' stellt. \nSobald der Hebel wieder zurück im Kasten ist, schließt der Arduino das Relais und schneidet sich somit selbst die Stromzufuhr ab. Solang die Schachtel nicht betätigt wird, wird absolut kein Strom verbraucht!", "time_created": "2020-02-05T11:07:21.752Z"}}]